# 金融风控训练营Task02数据分析学习笔记
本学习笔记为阿里云天池龙珠计划Docker训练营的学习内容，学习链接为：
https://tianchi.aliyun.com/specials/activity/promotion/aicampfr?spm=5176.12901015.0.i12901015.419b525cZREgQM

## 一、学习知识点概要
* 数据总体了解                                              
* 缺失值和唯一值
* 数据类型
* 数据间相关关系
* 数据报告

## 二、学习内容
### 知识点
* TSV是用制表符（Tab,'\t'）作为字段值的分隔符；CSV是用半角逗号（','）作为字段值的分隔符；
* pandas:通过nrows参数，来设置读取文件的前多少行，nrows是一个大于等于0的整数。


## 三、学习问题与解答

## 四、学习思考与总结
task02学习了对数据整体概况和一些变量的基本情况、相互关系等的分析，包括数据的可视化思想，
遇到了点python语法上的问题，也顺带复习了一下python，
而到目前为止的学习来说，感觉方法多而杂，知识体量大而乱，然后python的库的运用也不是特别的熟悉，所以依然是觉得有点迷茫，
当拿到题目和数据的时候可能仍然是会无从下手
